# St7SetNodeColours

Sets the colours used to display nodes.

long St7SetNodeColours(long uID, long* Colours, long NumCol)
Input Parameters
uID
Strand7 model file ID.
Colours[0..1]
[clNodeUnselected] – The unselected node colour.
[clNodeSelected] – The selected node colour.
See also RGB Colours.
NumCol
The size of Colours.